app/controllers/events_controller.rb

INSERT INTO "events" ("name", "time", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ruby"], ["time", "2016-10-15 00:00:00.000000"], ["location", "45 william"], ["created_at", "2016-05-17 13:10:10.795617"], ["updated_at", "2016-05-17 13:10:10.795617"]]
---
  def create
    event = Event.new
    event.name = Event.first
    event.time = params[:time]
    event.total_seats = params[:total_seats].to_i
    if event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "events" SET "name" = $1, "time" = $2, "location" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["name", "css"], ["time", "2012-10-30 00:00:00.000000"], ["location", "Sydney, Australia"], ["updated_at", "2016-05-17 13:19:17.904292"], ["id", 2]]
---
  def update
    event = Event.find(params[:id])
    event.name = Event.first
    event.time = params[:time]
    if event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]
---
  def destroy
    event = Event.find(params[:id])
    event.destroy