app/controllers/speakers_controller.rb

  def index
    @speakers = Speaker.all
---
SELECT "speakers".* FROM "speakers"

  def create
    speaker = Speaker.new
    speaker.name = params[:name]
    speaker.desc = params[:desc]
    speaker.img = params[:img]
    if speaker.save
---
INSERT INTO "speakers" ("name", "desc", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "DT"], ["desc", "wdi teacher"], ["img", ""], ["created_at", "2016-05-17 13:42:37.212023"], ["updated_at", "2016-05-17 13:42:37.212023"]]

  def edit
    @speaker = Speaker.find(params[:id])
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    speaker = Speaker.find(params[:id])
    speaker.name = params[:name]
    speaker.desc = params[:desc]
    speaker.img = params[:img]
    if speaker.save
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "speakers" SET "name" = $1, "updated_at" = $2 WHERE "speakers"."id" = $3  [["name", "Daniel T"], ["updated_at", "2016-05-17 13:42:48.762386"], ["id", 1]]

  def destroy
    speaker = Speaker.find(params[:id])
    speaker.destroy
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "speakers" WHERE "speakers"."id" = $1  [["id", 1]]