app/controllers/tickets_controller.rb

  def create
    amount_of_tickets = params[:amount].to_i
    amount_of_tickets.times do
      ticket = Ticket.new
      # event_id = params[:event_id]
      # user_id = params[:user_id]
      # hard code first, after finish login and schedule part, then pass these params.
      ticket.event_id = Event.first.id
      ticket.user_id = User.first.id
      ticket.save
---
SELECT  "events".* FROM "events"  ORDER BY "events"."id" ASC LIMIT 1
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "tickets" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 1], ["user_id", 1], ["created_at", "2016-05-17 12:03:04.301382"], ["updated_at", "2016-05-17 12:03:04.301382"]]

  def show
    user_id = params[:id]
    @tickets = Ticket.where(user_id: user_id);
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = $1  [["user_id", 1]]